---
kind: type
id: T:Autodesk.Revit.UI.TaskDialogCommandLinkId
source: html/21d69e07-93bf-18a6-1b76-c7e917edf897.htm
---
# Autodesk.Revit.UI.TaskDialogCommandLinkId

Enum to specify the Id of CommandLink.

## Syntax (C#)
```csharp
public enum TaskDialogCommandLinkId
```